Repository: AndrewCrewKuznetsov/xneur-devel
Catalog: kxneur/po/*.po
Languages: uk

source: _: NAME OF TRANSLATORS Your names
uk: Вадим Ліхота,Юрій Чорноіван

source: _: EMAIL OF TRANSLATORS Your emails
uk: vadim-lvv@yandex.ru,yurchor@ukr.net

source: Start xneur daemon
uk: Запустити службу xneur

source: Wrong XNeur configuration library api version. Please install libxnconfig version
uk: Неправильна версія інтерфейсу бібліотеки налаштування XNeur. Будь ласка, встановіть версію libxnconfig

source: XNeur config broken! Please, remove ~/.xneur/xneurrc and reinstall XNeur package!
uk: Налаштування XNeur пошкоджено! Будь ласка, вилучіть файл ~/.xneur/xneurrc і перевстановіть пакунок XNeur!

source: Stop xneur daemon
uk: Зупинити службу xneur

source: Couldn't start xneur Verify that it installed
uk: Не вдалося запустити xneur Перевірте, чи встановлено цю програму

source: Set auto mode
uk: Встановити автоматичний режим

source: Set manual mode
uk: Встановити ручний режим

source: * Unknown lang *
uk: * Нерозпізнана мова*

source: KXNeur (front-end) options
uk: Налаштування КXNeur (front-end'у)

source: Run NXeur with start KXNeur
uk: Запускати службу xneur разом з kxneur

source: Start XNeur with '--force' option
uk: Запускати xneur з параметром '--force

source: With this option xneur don't check other xneur copies in ram
uk: Якщо обрати цей параметр xneur не перевірятиме наявність інших запущених копій

source: Autostart
uk: Автозапуск

source: Autostart of the program when entering the session. If recovery mode was enabled in KDE and KXNeur is running when exiting from this session, then KXneur will run automatically regardless of autostart setting.
uk: Автозапуск програми під час відкриття сеансу. Якщо в KDE встановлено режим відновлення сеансу і KXNeur було запущено під час виходу з останнього сеансу, то програма запуститься незалежно від того, чи встановлено автозапуск.

source: Switcher mode
uk: Режим перемикача

source: This mode switches between two languages used the last. For select anothey language need pointed it. For selecting the third language one needs to click it in the program menu. The switcher mode makes sense if one uses three or more languages.
uk: Цей режим перемикає між двома мовами, що використовувалися востаннє. Для вибору третьої мови необхідно вказати її мишею у меню програми. Режим перемикача має сенс за наявності трьох чи більше мов.

source: show flag in tray
uk: показувати прапорець у лотку

source: show lang in tray
uk: показувати код мови у лотку

source: The style of icon reflected in the tray
uk: Стиль значка, що показується у лотку

source: XNeur (daemon) options
uk: Налаштування служби XNeur

source: Change iNCIDENTAL CapsLock
uk: Заміняти вИПАДКОВИЙ CapsLock

source: Change two CApital letter
uk: Заміняти дві ПРописні літери

source: Flush internal buffer when pressed Enter
uk: Спорожняти внутрішній буфер після натискання Enter

source: Don't correct word when pressed Enter
uk: Не виправляти слово після натискання Enter

source: Enable Education Mode
uk: Увімкнути режим самонавчання

source: All the returned (incorrect) switchings will be automatically added to the dictionary.
uk: Усі повернуті (невірні) перемикання будуть автоматично заноситися до словника.

source: Processing Mouse Events
uk: Обробляти клацання мишею

source: If activated this mode considers not only Space, Tab, Enter etc. to be the end of a word, but also mouse clicking to another field.
uk: За умови активації цього режиму закінченням слова буде вважатися не тільки Пробіл, Табуляція, Enter та інше, але й переведення курсора до іншого поля введення клацанням миші.

source: Save Selection After Change Selected Text
uk: Зберігати виділення після зміни виділеного тексту

source: Save Keyboard Log
uk: Вести журнал клавіатури

source: Set Mode on Start
uk: Встановити режим роботи при запуску

source: Automatic
uk: Автоматичний

source: Manual
uk: Ручний

source: The mode of program working set with its start
uk: Режим роботи програми, який буде встановлено під час її старту

source: Set Default Language for programs
uk: Встановити типову мову для програм

source: Define initial keyboard layout for all new applications
uk: Встановити розкладку для усіх нових програм

source: Delay before send event (in milliseconds)
uk: Затримка перед дією (у мілісекундах)

source: Layouts
uk: Розкладки

source: Language Name
uk: Мова

source: Number
uk: Номер

source: English
uk: Англійська

source: Russian
uk: Російська

source: Ukrainian
uk: Українська

source: Belarusian
uk: Білоруська

source: French
uk: Французька

source: Romanian
uk: Румунська

source: Kazakh
uk: Казахська

source: German
uk: Німецька

source: A number of the language group. NB! The numbers must be unique.
uk: Номер групи мови. Номера не повинні повторюватися!

source: Dictionary...
uk: Словник...

source: The dictionaries for identification of certain language words. The words must be typed in Latine layout. For example, Russian 'tree' must be typed as 'lthtdj'.
uk: Словники розпізнавання слів будь-якої мови. Слова повинні набиратися в латинській розкладці. Наприклад, 'дерево' має бути набрано як 'lthtdj'.

source: Regular Expressions...
uk: Регулярні вирази...

source: To set a word in the form of regular expression
uk: Задати слово у вигляді регулярного виразу

source: The block of layouts allow to set languages and words for their processing by the program.
uk: Блок розкладок дозволяє задати мови й слова, що використовуватимуться для їх обробки програмою.

source: Remember Layout For Each Window
uk: Запам'ятати розкладку для кожного вікна

source: Program will save a language for each window.
uk: Програма буде запам'ятовувати мову для кожного вікна.

source: Excluded List (one layout for program)
uk: Винятки (одна розкладка на програму)

source: List of the programs or names of MainWindow of these programs that coincide in most cases.
uk: Перелік програм чи назв MainWindow цих програм, які в більшості випадків збігаються.

source: Add program from list...
uk: Додати програму з переліку

source: List of the running graphical programs or the names of their MainWindow (for several programs, for example sim, they do not coincide). If You do not see in the list your program use the button 'Point the window' below. The list of the programs was received by a query of child windows of the root-window by means of xwininfo from x11-tools.
uk: Перелік поточних графічних програм чи назв їх MainWindow (для деяких програм, наприклад sim, вони не збігаються). Якщо Ви не бачите у переліку своєї програми, скористайтеся кнопкою «Вказати вікно», розташованою нижче. Перелік програм було отримано опитуванням дочірніх вікон root-window за допомогою xwininfo з x11-tools.

source: Point window...
uk: Вказати вікно...

source: After pressing the button 'Point the button' one should make mouse click on a program window that must be added to the list. It is possible one will have to point out several windows for some sdi programs that have independant windows. Xprop from X11 is used for receiving the information of pointed window.
uk: Після натиснення кнопки «Вказати вікно» слід клацнути мишею на вікні програми, яку потрібно додати до переліку. Для деяких sdi програм, що мають незалежні вікна, можливо, доведеться вказати декілька вікон. Для отримання інформації про вказане вікно використовується xprop з X11.

source: Excluded List
uk: Перелік винятків

source: Force Automatic Processing List
uk: Перелік для примусової автоматичної обробки

source: Force Manual Processing List
uk: Перелік для примусової ручної обробки

source: Enable sounds on XNeur actions
uk: Активувати озвучення дій XNeur

source: Press Key On Layout 1
uk: Натисніть клавішу для 1 розкладки

source: Press Key On Layout 2
uk: Натисніть клавішу для 2 розкладки

source: Press Key On Layout 3
uk: Натисніть клавішу для 3 розкладки

source: Press Key On Layout 4
uk: Натисніть клавішу для 4 розкладки

source: Enable Layout 1
uk: Активувати першу розкладку

source: Enable Layout 2
uk: Активувати другу розкладку

source: Enable Layout 3
uk: Активувати третю розкладку

source: Enable Layout 4
uk: Активувати четверту розкладку

source: Automatic Change Word
uk: Автоматична зміна слова

source: Manual Change Word
uk: Ручна зміна слова

source: Change String
uk: Зміна рядка

source: Change Selected Text
uk: Зміна виділеного тексту

source: Translit Selected Text
uk: Транслітерація виділеного тексту

source: Changecase Selected Text
uk: Зміна виділеного тексту

source: List of sounds
uk: Список звуків

source: Settings
uk: Налаштування

source: Common
uk: Загальні

source: Commons Options
uk: Загальні налаштування

source: Languages
uk: Мови

source: Languages Options
uk: Мовні налаштування

source: Keys
uk: Клавіші

source: Key Combinations
uk: Комбінації клавіш

source: Programs
uk: Програми

source: Exclusions for Program
uk: Винятки для програм

source: Sounds
uk: Звуки

source: Sounds for Events
uk: Звуки для подій

source: Replace / Cancel Replace
uk: Заміна / Скасування заміни

source: Replace Last String
uk: Заміна останнього рядка

source: Change Processing Mode
uk: Зміна режиму роботи

source: Replace Selected Text
uk: Заміна виділеного тексту

source: Transliterate Selected Text
uk: Транслітерація виділеного тексту

source: Change Case Selected Text
uk: Зміна регістру виділеного тексту

source: Enable First Layout
uk: Активувати першу розкладку

source: Enable Secondary Layout
uk: Активувати другу розкладку

source: Enable Thrid Layout
uk: Активувати третю розкладку

source: Enable Fourth Layout
uk: Активувати четверту розкладку

source: warning! kdelibs have bug with Ctrl+Break
uk: увага! kdelibs має ваду пов’язану з Ctrl+Break

source: current programs:
uk: поточні програми

source: KXNeur (KDE X Neural Switcher) is XNeur front-end for KDE ( http://xneur.ru ). This version work with XNeur v.0.9.2 only
uk: KXNeur (KDE X Neural Switcher) — клієнтська частина XNeur для KDE ( http://xneur.ru ). Ця версія працює тільки з XNeur v.0.9.2

source: keyboard autoswitcher
uk: автоперемикач розкладок клавіатури

source: Authors X Neural Switcher, including Andrew Crew Kuznetsov and Yankin Nickolay Valerevich
uk: Автори X Neural Switcher, у т.ч. Андрій Crew Кузнєцов и Янкін Микола Валерійович

source: Author kkbswitch,
uk: Автор kkbswitch,
